In [1]:
import pandas as pd

In [2]:
users = pd.read_csv("./datasets/users.csv")

In [3]:
users

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [5]:
users.pivot(index = 'weekday',
            columns = 'city',
            values = 'visitors')

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

In [6]:
users.pivot(index = 'weekday', 
            columns='city', 
            values = 'signups')

city     Austin  Dallas
weekday
Mon           3       5
Sun           7      12

In [7]:
users.pivot(index = 'weekday', 
            columns='city')

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

# Stacking and Unstacking Dataframes

In [14]:
users = pd.read_csv("./datasets/users.csv")
users

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [15]:
users.set_index(['city', 'weekday'],inplace=True)

In [16]:
users.sort_index(inplace=True)

In [17]:
users

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [22]:
users.index

MultiIndex([('Austin', 'Mon'),
            ('Austin', 'Sun'),
            ('Dallas', 'Mon'),
            ('Dallas', 'Sun')],
           names=['city', 'weekday'])

In [18]:
byweekday = users.unstack(level = 'weekday')

In [19]:
byweekday

        visitors      signups
weekday      Mon  Sun     Mon Sun
city
Austin       326  139       3   7
Dallas       456  237       5  12

In [23]:
byweekday.stack(level = 'weekday')

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [24]:
users

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [26]:
bycity = users.unstack(level = 'city')

In [39]:
bycity

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

In [29]:
bycity.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, Mon to Sun
Data columns (total 4 columns):
(visitors, Austin)    2 non-null int64
(visitors, Dallas)    2 non-null int64
(signups, Austin)     2 non-null int64
(signups, Dallas)     2 non-null int64
dtypes: int64(4)
memory usage: 80.0+ bytes

In [31]:
bycity.columns

MultiIndex([('visitors', 'Austin'),
            ('visitors', 'Dallas'),
            ( 'signups', 'Austin'),
            ( 'signups', 'Dallas')],
           names=[None, 'city'])

In [34]:
bycity.loc[:, ('visitors')]

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

In [35]:
bycity.stack(level = 'city')

                visitors  signups
weekday city
Mon     Austin       326        3
        Dallas       456        5
Sun     Austin       139        7
        Dallas       237       12

In [52]:
bycity

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

In [53]:
newusers = bycity.stack(level = 'city')
newusers

                visitors  signups
weekday city
Mon     Austin       326        3
        Dallas       456        5
Sun     Austin       139        7
        Dallas       237       12

In [54]:
newusers.swaplevel(0,1).sort_index()

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [51]:
newusers

                visitors  signups
weekday city
Mon     Austin       326        3
        Dallas       456        5
Sun     Austin       139        7
        Dallas       237       12